src/OpenFoam/Airfoil_simulation_1/OpenFOAM_4/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    front
    {
        type            empty;
        physicalType    patch;
        nFaces          47661;
        startFace       71186;
    }
    back
    {
        type            empty;
        physicalType    patch;
        nFaces          47661;
        startFace       118847;
    }
    exit
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       166508;
    }
    bottom
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       166558;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       166608;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       166658;
    }
    aerofoil
    {
        type            wall;
        physicalType    patch;
        nFaces          411;
        startFace       166708;
    }
)

// ************************************************************************* //
